lib/tasks/dev.rake

SELECT  "mining_types".* FROM "mining_types" WHERE "mining_types"."acronym" = ? LIMIT ?  [["acronym", "PoW"], ["LIMIT", 1]]
SELECT "mining_types".* FROM "mining_types"
SELECT  "mining_types".* FROM "mining_types" WHERE "mining_types"."description" = ? AND "mining_types"."acronym" = ? LIMIT ?  [["description", "Proof of Work"], ["acronym", "PoW"], ["LIMIT", 1]]
SELECT  "coins".* FROM "coins" WHERE "coins"."description" = ? AND "coins"."acronym" = ? AND "coins"."url_image" = ? AND "coins"."mining_type_id" = ? LIMIT ?  [["description", "Bitcoin"], ["acronym", "BTC"], ["url_image", "https://e7.pngegg.com/pngimages/261/204/png-clipart-bitcoin-bitcoin-thumbnail.png"], ["mining_type_id", 1], ["LIMIT", 1]]
SELECT  "coins".* FROM "coins" WHERE "coins"."description" = ? AND "coins"."acronym" = ? AND "coins"."url_image" = ? LIMIT ?  [["description", "Bitcoin"], ["acronym", "BTC"], ["url_image", "https://e7.pngegg.com/pngimages/261/204/png-clipart-bitcoin-bitcoin-thumbnail.png"], ["LIMIT", 1]]
INSERT INTO "coins" ("description", "acronym", "url_image", "created_at", "updated_at", "mining_type_id") VALUES (?, ?, ?, ?, ?, ?)
---
  task add_coins: :environment do
    show_spinner("Cadastrando Moedas..") do
  coins = [
      {
          description: "Bitcoin",
          acronym: "BTC",
          url_image: "https://e7.pngegg.com/pngimages/261/204/png-clipart-bitcoin-bitcoin-thumbnail.png",
          mining_type: MiningType.find_by(acronym: 'PoW')
      },
      {
          description: "Ethereum",
          acronym: "ETH",
          url_image: "https://w7.pngwing.com/pngs/368/176/png-transparent-ethereum-cryptocurrency-blockchain-bitcoin-logo-bitcoin-angle-triangle-logo-thumbnail.png",
          mining_type: MiningType.all.sample
      },
      {
          description: "Dash",
          acronym: "DASH",
          url_image: "https://images.getpng.net/uploads/preview/cryptocurrency-vector-coins-icons-isolated-white-background-98-1151646499716eb1owavio8.webp",
          mining_type: MiningType.all.sample
      },
      {
          description: "Iota",
          acronym: "IOT",
          url_image: "https://image.shutterstock.com/image-vector/golden-iota-coin-crypto-currency-260nw-779202067.jpg",
          mining_type: MiningType.all.sample
      },
      {
          description: "ZCash",
          acronym: "ZEC",
          url_image: "https://s2.coinmarketcap.com/static/img/coins/200x200/1437.png",
          mining_type: MiningType.all.sample
      }
  ]
    coins.each do |coin|
      Coin.find_or_create_by!(coin)

INSERT INTO "mining_types" ("description", "acronym", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["description", "Proof of Work"], ["acronym", "PoW"], ["created_at", "2022-06-20 02:07:19.464339"], ["updated_at", "2022-06-20 02:07:19.464339"]]
---
  task add_mining_types: :environment do
    show_spinner("Cadastrando tipos de mineração..") do
      mining_types = [
        {description: "Proof of Work", acronym: "PoW"},
        {description: "Proof of Stake", acronym: "PoS"},
        {description: "Proof of Capacity", acronym: "PoC"}
    ]
      mining_types.each do |mining_type|
        MiningType.find_or_create_by!(mining_type)