app/controllers/coins_controller.rb

INSERT INTO "coins" ("description", "acronym", "url_image", "created_at", "updated_at", "mining_type_id") VALUES (?, ?, ?, ?, ?, ?)  [["description", ""], ["acronym", ""], ["url_image", ""], ["created_at", "2022-07-12 19:31:29.474935"], ["updated_at", "2022-07-12 19:31:29.474935"], ["mining_type_id", 1]]
---
  def create
    @coin = Coin.new(coin_params)

    respond_to do |format|
      if @coin.save

UPDATE "coins" SET "mining_type_id" = ?, "updated_at" = ? WHERE "coins"."id" = ?  [["mining_type_id", 2], ["updated_at", "2022-06-22 01:34:08.690604"], ["id", 5]]
---
  def update
    respond_to do |format|
      if @coin.update(coin_params)